app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @account = Account.find(params[:id])

INSERT INTO "accounts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Daniel"], ["created_at", "2020-03-05 02:51:52.075672"], ["updated_at", "2020-03-05 02:51:52.075672"]]
INSERT INTO "students" ("name", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Daniel"], ["account_id", 1], ["created_at", "2020-03-05 02:51:52.080791"], ["updated_at", "2020-03-05 02:51:52.080791"]]
INSERT INTO "tutors" ("name", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Daniel"], ["account_id", 1], ["created_at", "2020-03-05 02:51:52.088576"], ["updated_at", "2020-03-05 02:51:52.088576"]]
---
    def create

        @account = Account.new(account_params)

        if Account.exists?(email: @account.email)
            puts "AAAAAAAAAAAAAAAAAAAAAA\n\n\n\n\n"
            redirect_to new_account_path, flash: {error: "Account already exists with that email"}
            return
        end
        puts(account_params)
        puts(@account.email)
        @student = @account.build_student()
        @tutor = @account.build_tutor()
        @account.save