app/controllers/accounts_controller.rb

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."account_id" = ? LIMIT 1  [["account_id", 1]]
---
	def index
        @accounts = Account.all.order(:name)
        @account = nil
        unless session[:account_id].nil?
            @account = Tutor.find(session[:account_id])