app/controllers/reviews_controller.rb

	def index
        @account = nil
        unless session[:account_id].nil?
            @account = Account.find(session[:account_id])
        end
        @tutor = Tutor.find(params[:tutor_id])
        @reviews = @tutor.reviews
        @subjects = @tutor.subjects
        if Subject.exists? id: params[:subject_id]
            @subject = Subject.find(params[:subject_id])
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

    def new
        @account = Account.find(session[:account_id])
        if Subject.exists? id: params[:subject_id]
            @subject = Subject.find(params[:subject_id])
        else
            @subject = nil
        end
        @tutor = Tutor.find(params[:tutor_id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", 4]]

    def create
    	@tutor = Tutor.find(params[:tutor_id])
        @account = Account.find(session[:account_id])
        if @account.tutor.id.to_s == @tutor.id.to_s
            flash[:error] = "You cannot leave reviews for yourself"
        else
    	    @review = @tutor.reviews.build(review_params)
            @account.student.reviews << @review
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("rating", "comment", "tutor_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 1], ["comment", "ehh"], ["tutor_id", 1], ["student_id", 1], ["created_at", "2020-03-05 06:15:32.411116"], ["updated_at", "2020-03-05 06:15:32.411116"]]