app/controllers/sessions_controller.rb

	def index
        @account = Account.find(session[:account_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]

    def new
    	@tutor = Tutor.find(params["tutor_id"])
    	@subject = Subject.find(params["subject_id"])
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

    def create
        @account = Account.find(session[:account_id])
    	@student = @account.student
        if params[:tutor_id].to_s == @account.tutor.id.to_s
            flash[:error] = "You cannot sign up for your own tutoring sessions."
            redirect_to subject_tutor_sessions_path(1,1)
        else
            #eventually differentiate it with start and end time
        	@time = Session.convert_time(params["session"])
            @start_time = @time[0]
            @end_time = @time[1]
            if @end_time == @start_time
                flash[:error] = "Cannot sign up for 0 minutes"
                redirect_to new_subject_tutor_session_path
            elsif @start_time < DateTime.now
                flash[:error] = "Start time cannot be in the past"
                redirect_to new_subject_tutor_session_path
            else
                @sessions = @account.student.sessions
                if Session.no_student_conflicting_times(@time, @sessions)
                    @tutor = Tutor.find(params[:tutor_id])
                    @subject = Subject.find(params["subject_id"])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]