app/controllers/students_controller.rb

INSERT INTO "students" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Daniel"], ["created_at", "2020-03-03 23:24:07.247300"], ["updated_at", "2020-03-03 23:24:07.247300"]]
---
    def create
        @student = Student.new(student_params)
        @student.save