app/controllers/students_controller.rb

	def index
        @account = Account.find(session[:account_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]