app/controllers/subjects_controller.rb

SELECT "tutors".* FROM "tutors"
---
    def show
        @subject = Subject.find(params[:id])
        @tutors = Tutor.all.select {|m| m.subject == @subject.name}