app/controllers/subjects_controller.rb

	def index
        @account = Account.find_by_id(session[:account_id])
        @subjects = Subject.all
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "subjects".* FROM "subjects"

    def show
        @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

    def create
        @subject = Subject.new(subject_params)
        @subject.save
---
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Math"], ["created_at", "2020-03-03 05:05:06.169791"], ["updated_at", "2020-03-03 05:05:06.169791"]]