app/controllers/tutors_controller.rb

    def index
        @account = nil
        unless session[:account_id].nil?
            @account = Account.find(session[:account_id])
        end
        @tutors = Tutor.all
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tutors".* FROM "tutors"

    def show
        @account = nil
        unless session[:account_id].nil?
            @account = Account.find(session[:account_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]

    def new
        @account = nil
        unless session[:account_id].nil?
            @account = Account.find(session[:account_id])
        end
        @subject = Subject.find(params[:subject_id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", nil]]

    def edit
        @subject = Subject.find(params[:id])
        @account = Account.find(session[:account_id])
        unless(@subject.tutors.exists?(id:@account.tutor.id))
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tutors".* FROM "tutors" INNER JOIN "subjects_tutors" ON "tutors"."id" = "subjects_tutors"."tutor_id" WHERE "subjects_tutors"."subject_id" = ? AND "tutors"."id" = ? LIMIT 1  [["subject_id", 2], ["id", 1]]
SELECT  1 AS one FROM "tutors" INNER JOIN "subjects_tutors" ON "tutors"."id" = "subjects_tutors"."tutor_id" WHERE "subjects_tutors"."subject_id" = ? AND "tutors"."id" = ? LIMIT 1  [["subject_id", 3], ["id", 1]]

    def create
        @account = nil
        unless session[:account_id].nil?
            @account = Tutor.find(session[:account_id])
        end
    	@subject = Subject.find(params[:subject_id])
        @tutor = @subject.tutors.build(tutor_params)
        @tutor.save
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tutors" ("name", "experience", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Daniel"], ["experience", 10], ["rate", 15.0], ["created_at", "2020-03-03 05:20:23.850467"], ["updated_at", "2020-03-03 05:20:23.850467"]]