app/views/accounts/show.html.haml

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."account_id" = ? LIMIT 1  [["account_id", 1]]
---
              %tr
                %td #{session.tutor.account.name} has rejected the session. Balance of $#{Order.print_money session.price_cents} has been returned to your account.
            - @completed_student_sessions.each do |session|